cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
#tap "homebrew/formula-analytics"
tap "homebrew/services"
#tap "homebrew/test-bot"

# Installs java which is pre-requisite for some below applications
cask "corretto8"

brew "ack" # Search tool like grep, but optimized for programmers
# brew "automake"
brew "awscli"
brew "bfg" # Remove large files or passwords from Git history like git-filter-branch
brew "binutils" # GNU binary tools for native development
brew "cmake" # cross platform make
brew "coreutils" # GNU File, Shell, and Text utilities
brew "curl"
brew "docker"
#brew "docker-machine"
brew "elasticsearch@6.8", restart_service: true
brew "exa"
brew "fd"
brew "fork-cleaner"
brew "fzf" # Command-line fuzzy finder written in Go
brew "ghi" # Github Issues command line
brew "git"
brew "go"
brew "gnupg"
brew "grc" # Colorize logfiles and command output
brew "heroku/brew/heroku"
brew "hub"
# brew "jansson" # C library for encoding, decoding, and manipulating JSON
# brew "jemalloc"
brew "jq"
brew "kubernetes-cli", link: false
# brew "kops"
brew "kubernetes-helm"
brew "launch_socket_server", restart_service: true
brew "launchdns", restart_service: true
# brew "lcov" # Graphical front-end for GCC's coverage testing tool (gcov)
# brew "macvim", args: ["custom-icons", "with-override-system-vim", "with-lua", "with-luajit"], link: false
brew "mas"
# brew "md5sha1sum"
# brew "memcached", restart_service: true
# brew "mysql@5.7", restart_service: true
# brew "nmap"
# brew "nginx", restart_service: true
# brew "node"
# brew "nss"
# brew "protobuf"
# brew "rakudo-star"
brew "ruby-build"
brew "rbenv"
brew "rbenv-default-gems"
brew "reattach-to-user-namespace" # Reattach process (e.g., tmux) to background
# brew "redis", restart_service: true
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "ruby"
brew "ruby@2.3"
brew "ruby@2.4"
brew "ruby@2.5"
brew "pinentry-mac"
# brew "postgresql"
# brew "python3"
# brew "python", link: false
brew "shellcheck"
brew "socat"
brew "ssh-copy-id"
brew "telnet"
brew "the_silver_searcher"
brew "tmux"
# brew "vim", args: ["with-lua"]
brew "watch"
# brew "wget"
brew "xz"
# brew "yaml-cpp" # C++ YAML parser and emitter for YAML 1.2 spec
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "zsh-history-substring-search"
brew "zsh-lovers"
brew "zsh-navigation-tools"
brew "zsh-syntax-highlighting"

cask "1password-cli"
# cask "1password"
# cask "adoptopenjdk8"
cask "appcleaner"
cask "amazon-chime"
cask "amazon-drive"
# cask "atom"
# cask "caffeine"
# cask "clipy"
# cask "crashplan"
cask "cyberduck"
cask "dropbox"
cask "dropbox-encore"
# cask "evernote"
cask "firefox"
cask "fork"
# cask "gitter" # https://gitter.im
cask "google-backup-and-sync"
cask "google-chrome"
cask "hyper"
cask "keepingyouawake"
cask "iterm2"
# cask "macdown"
cask "megasync"
# cask "menubar-stats"
# cask "microsoft-office"
# cask "microsoft-teams"
# cask "minikube"
# cask "onedrive"
cask "pdk"
cask "quickbooks-online"
# cask "safari-tab-switching"
cask "sizeup"
# cask "sketch"
# cask "skitch"
# cask "skype"
# cask "skype-for-business"
# cask "slack"
cask "spectacle"
cask "spotify"
cask "subler"
# cask "sublime-text"
cask "teamviewer"
# cask "transmission"
# cask "vagrant"
# cask "vagrant-manager"
cask "vanilla"
# cask "virtualbox"
cask "visual-studio-code"
# cask "visualvm"
# cask "vlc"
# cask "vmware-fusion"
# cask "vyprvpn"
# cask "whatsapp"
# cask "wireshark"
cask "zoomus"

# mas "1Blocker", id: 1107421413
mas "1Password 7", id: 1333542190
mas "CopyClip", id: 595191960
# mas "Dr. Antivirus", id: 1068435535
# mas "DrCleaner", id: 921458519
mas "Droplr", id: 498672703
mas "Evernote", id: 406056744
# mas "GarageBand", id: 682658836
mas "GIPHY Capture", id: 668208984
mas "Grids", id: 963509558
# mas "iMovie", id: 408981434
# mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
# mas "MemoryKeeper", id: 689992800
mas "Microsoft Remote Desktop", id: 1295203466
# mas "Numbers", id: 409203825
mas "NordVPN", id: 1116599239
mas "OneDrive", id: 823766827
# mas "Pages", id: 409201541
# mas "Pixelmator Pro", id: 1289583905
# mas "Remote Desktop", id: 409907375
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
# mas "Spark", id: 1176895641
# mas "Tweetbot", id: 1384080005
# mas "TweetDeck", id: 485812721
# mas "Twitter", id: 409789998
# mas "Winmail DAT Exporter", id: 1059623291
# mas "Winmail DAT File Viewer", id: 1030699881
# mas "Winmail Reader Lite", id: 998287089
# mas "Wunderlist", id: 410628904
mas "Xcode", id: 497799835

